<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Oracle's Java 7. Finds and downloads the latest Oracle Java 7 JDK.

To use this recipe, you must accept the Oracle Binary Code License Agreement for Java SE.
http://www.oracle.com/technetwork/java/javase/terms/license/index.html
    </string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.OracleJavaJDK7</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OracleJavaJDK7</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.oracle.com/technetwork/java/javase/downloads/jdk7-downloads-1880260.html</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://download.oracle.com/otn-pub/java/jdk/.*?/jdk-7.*?x64.dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>request_headers</key>
                <dict>
                    <key>Cookie</key>
                    <string>oraclelicense=accept-securebackup-cookie</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
