<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for The Unarchiver. Finds and downloads the latest&apos;The Unarchiver&apos; release.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.download.TheUnarchiver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TheUnarchiver</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://wakaba.c3.cx/s/apps/unarchiver</string>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;http://unarchiver.c3.cx/downloads/TheUnarchiver[0-9\.]+zip)</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
