<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Rebuilds Munki catalogs in munki_repo_path if any other recipe imported something.</string>
    <key>Input</key>
    <dict>
        <key>IDENTIFIER</key>
        <string>com.github.autopkg.munki.makecatalogs</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MakeCatalogsProcessor</string>
            <key>Arguments</key>
            <dict>
                <key>munki_repo_path</key>
                <string>%MUNKI_REPO%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>