<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Evernote.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.Evernote</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Evernote</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<!--<string>https://cdn1.evernote.com/boron/mac/builds/Evernote-.[A-Za-z0-9\-\.]\.dmg</string>-->
				<string>https:\/\/cdn1\.evernote\.com\/boron\/mac\/builds\/Evernote-\d+\.\d+\.\d+-mac-ddl-stage-\d+-[a-fA-F0-9]+\.dmg</string>
                <key>url</key>
				<string>https://cdn1.evernote.com/boron/mac/public/latest-mac.yml</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Evernote.app</string>
                <key>requirement</key>
                <string>(anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Q79WDW8YH9) and identifier "com.evernote.Evernote"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
