<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads and installs latest Silverlight installer.</string>
        <key>Identifier</key>
        <string>com.github.autopkg.install.Silverlight</string>
        <key>Input</key>
        <dict/>
        <key>MinimumVersion</key>
        <string>0.6.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.download.Silverlight</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>Installer</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%/Silverlight.pkg</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
