<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads latest Silverlight installer and copies the package to the build directory with an appended version number.</string>
        <key>Identifier</key>
        <string>com.github.autopkg.pkg.Silverlight</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Silverlight</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.download.Silverlight</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%pathname%/Silverlight.pkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/expand</string>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>file:////%RECIPE_CACHE_DIR%/expand/Distribution</string>
                    <key>re_pattern</key>
                    <string>product id="com.microsoft.silverlight" version="(?P&lt;version&gt;.*?)"</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%pathname%/Silverlight.pkg</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/Silverlight-%version%.pkg</string>
                </dict>
                <key>Processor</key>
                <string>PkgCopier</string>
            </dict>
        </array>
    </dict>
</plist>
