<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>A description about your software</string>
    <key>Identifier</key>
    <string>Your identifier</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>dummy</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/dummy</string>
        <key>MUNKI_CATEGORY</key>
        <string>dummycategory</string>
        <key>MUNKI_DEVELOPER</key>
        <string>dummydeveloper</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>wethinkcode</string>
                <string>wethinkcode-testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>description</key>
            <string>A description of your app</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>yourparentrecipe</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
