<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current Adobe Acrobat Reader DC pkg and installs it.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.install.AdobeReaderDC</string>
	<key>Input</key>
	<dict>
		<key>LANGUAGE</key>
		<string>English</string>
		<key>MAJOR_VERSION</key>
		<string>AcrobatDC</string>
		<key>NAME</key>
		<string>AdobeReader</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.AdobeReaderDC</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe will soon be removed. Please remove it from your list of recipes.</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
