<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Adobe Reader. This recipe is based on com.github.autopkg.download.AdobeReader and customized by wycomco (http://www.wycomco.de) to support the download of updater packages that are needed for non-english versions of Adobe Reader.
Set MAJOR_VERSION to "10" to get the latest/last version of Adobe Reader 10 instead of 11.
</string>
	<key>Identifier</key>
	<string>com.github.autopkg.download.AdobeReaderUpdates</string>
	<key>Input</key>
	<dict>
		<key>LANGUAGE</key>
		<string>English</string>
		<key>MAJOR_VERSION</key>
		<string>11</string>
		<key>MULTILANGUAGE_UPDATER</key>
		<string>true</string>
		<key>NAME</key>
		<string>AdobeReader</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>language</key>
				<string>%LANGUAGE%</string>
				<key>major_version</key>
				<string>%MAJOR_VERSION%</string>
				<key>multilanguage_updater</key>
				<string>%MULTILANGUAGE_UPDATER%</string>
			</dict>
			<key>Processor</key>
			<string>AdobeReaderURLProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
