<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for XQuartz. Downloads latest XQuartz disk image.

Override BRANCH with either 'beta' or 'release' for the applicable Sparkle feed.
        </string>
        <key>Identifier</key>
        <string>com.github.autopkg.download.xquartz</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>XQuartz</string>
            <key>BRANCH</key>
            <string>release</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will soon be removed. Please remove it from your list of recipes.</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>SparkleUpdateInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>appcast_url</key>
                    <string>https://www.xquartz.org/releases/sparkle/%BRANCH%.xml</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%url%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/XQuartz.pkg</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Apple Inc. - XQuartz (NA574AWV7E)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
