<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Grammarly and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.homebysix.munki.Grammarly</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Grammarly</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/grammarly</string>
        <key>MUNKI_CATEGORY</key>
        <string>Tools</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Max Lytvynm, Alex Shevchenko</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>wethinkcode</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>description</key>
            <string>App and web service for correcting grammatical issues and detecting plagarism.</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.homebysix.download.Grammarly</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
