<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads and installs the latest Office 2011 update.</string>
        <key>Identifier</key>
        <string>com.github.autopkg.install.Office2011Updates</string>
        <key>Input</key>
        <dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.2</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.Office2011Updates</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will soon be removed. Please remove it from your list of recipes.</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Installer</string>
            </dict>
        </array>
    </dict>
</plist>
