<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Finds latest Office 2011 update and downloads the disk image.
Set VERSION to a specific version number to download that version instead.
Set CULTURE_CODE to a different value to get a different localization. See http://msdn.microsoft.com/en-us/library/ee825488(v=cs.20).aspx for a table of Culture Codes.

If you would like to use an undocumented HTTPS download, set DOWNLOAD_URL_SCHEME to https.
        </string>
        <key>Identifier</key>
        <string>com.github.autopkg.download.Office2011Updates</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Office2011_update</string>
            <key>VERSION</key>
            <string>latest</string>
            <key>CULTURE_CODE</key>
            <string>0409</string>
            <key>DOWNLOAD_URL_SCHEME</key>
            <string>http</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will soon be removed. Please remove it from your list of recipes.</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MSOffice2011UpdateInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>culture_code</key>
                    <string>%CULTURE_CODE%</string>
                    <key>munki_update_name</key>
                    <string>%NAME%</string>
                    <key>version</key>
                    <string>%VERSION%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/Office*.*pkg</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
