<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Android Studio disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.foigus.munki.AndroidStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AndroidStudio</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/android-studio</string>
        <key>MUNKI_CATEGORY</key>
        <string>IDE</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Google</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>wethinkcode</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>description</key>
            <string>Android Studio is the official IDE for Android application development, based on IntelliJ IDEA.</string>
            <key>requires</key>
            <array>
                <string>OracleJava8JDK</string>
            </array>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.novaksam.download.AndroidStudio</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
