<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.jarias.munki.CLion</string>
    <key>Description</key>
    <string>Downloads CLion and imports into Munki.</string>
    <key>Input</key>
    <dict>
    	<key>NAME</key>
    	<string>Rider</string>
    	<key>MUNKI_REPO_SUBDIR</key>
    	<string>apps/jetbrains</string>
    	<key>MUNKI_CATEGORY</key>
		<string>IDE</string>
		<key>MUNKI_DEVELOPER</key>
		<string>JetBrains</string>
    	<key>pkginfo</key>
    	<dict>
        	<key>catalogs</key>
			<array>
				<string>wethinkcode</string>
				<string>wethinkcode-testing</string>
			</array>
        	<key>description</key>
        	<string>A cross-platform .NET IDE by JetBrains, creators of IntelliJ IDEA and ReSharper. Supports C#, ASP.NET, ASP.NET MVC, .NET Core, Unity and Xamarin.</string>
        	<key>display_name</key>
        	<string>%NAME%</string>
        	<key>name</key>
        	<string>%NAME%</string>
        	<key>category</key>
        	<string>%MUNKI_CATEGORY%</string>
        	<key>developer</key>
        	<string>%MUNKI_DEVELOPER%</string>
       		</string>
      	</dict>
    </dict>
    <key>Process</key>
    <array>
      	<dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
        	<key>url</key>
        	<string>https://data.services.jetbrains.com/products/releases?code=RD</string>
        	<key>re_pattern</key>
        	<string>mac":{"link":"(.+?dmg)"</string>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
        	<key>url</key>
        	<string>%match%</string>
        	<key>filename</key>
        	<string>%NAME%.dmg</string>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
        	<key>pkg_path</key>
        	<string>%pathname%</string>
        	<key>repo_subdirectory</key>
        	<string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
    	</dict>
    	<dict>
        	<key>Processor</key>
        	<string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict>
</plist>
