<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Fetches the latest Sassafras KeyClient Mac installer and imports into
Munki. We fetch the legacy bundle-style installer because it has support for
a customized installation tool, 'k2clientconfig'.

K2CLIENTCONFIG_OPTIONS is a string that should be overridden with command-line
options to the 'k2clientconfig' tool. No sanity checking is performed beyond
what's done by k2clientconfig. The recipe includes one suggested default, more
documentation here:
http://www.sassafras.com/hrl/7.0/k2clientconfigM.html

There are k2clientconfig options to kill KeyAccess before installation, and to
start it after installation, implying we might not necessarily need a logout.
Some testing shows that when these options are used, the installation is still
not in a consistent state. Requiring a restart seems the only sane choice for now,
but it should be further investigated.

Sassafras uses two decimals in their mpkg versions (skipping the third) and
use three decimals everywhere else (webpage, actual bundle files, etc.). We let
makepkginfo use the package versions as-is. However, we use a separate installs
item for KeyAccess.app, because the options passed to k2clientconfig may alter
which packages are installed, and therefore the receipts array.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.sassafras-k2client</string>
    <key>Input</key>
    <dict>
        <key>K2CLIENTCONFIG_OPTIONS</key>
        <string>-s 2 -h keyserver.my.org -g yes -c yes -l yes</string>
        <key>NAME</key>
        <string>K2Client</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>support/K2Client</string>
        <key>pkginfo</key>
        <dict>
            <key>RestartAction</key>
            <string>RequireRestart</string>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>This is the client for the Sassafras KeyServer licensing managing software.</string>
            <key>display_name</key>
            <string>KeyClient</string>
            <key>name</key>
            <string>%NAME%</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.sassafras-k2client</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%filename%/K2Client.mpkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/scratch/K2Client.mpkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>base_mpkg_path</key>
                <string>%RECIPE_CACHE_DIR%/scratch/K2Client.mpkg</string>
                <key>k2clientconfig_options</key>
                <string>%K2CLIENTCONFIG_OPTIONS%</string>
            </dict>
            <key>Processor</key>
            <string>SassafrasK2ClientCustomizer</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/scratch/KeyAccessUnpack</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/scratch/K2Client.mpkg/Contents/KeyAccess.pkg/Contents/Archive.pax.gz</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/scratch/KeyAccessUnpack/Library</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/scratch/K2Client.mpkg</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/scratch/K2Client.dmg</string>
            </dict>
            <key>Processor</key>
            <string>DmgCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/scratch/KeyAccessUnpack</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Library/KeyAccess/KeyAccess.app</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/scratch/K2Client.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/scratch</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
