<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads updates for Adobe Acrobat Pro X or XI and imports them
into Munki. It will also set the appropriate 'requires' item for the
previous update in the Munki pkginfo, if applicable. Historically,
quarterly scheduled updates have been cumulative for Pro X/XI, and
out-of-cycle updates have not.

The name(s) in update_for in the pkginfo should be set to the name
of your base Adobe Acrobat Pro X or XI installer item in your Munki repo.

MAJOR_VERSION can be '10', '11', corresponding to Pro X, Pro XI,
etc. You can override this recipe multiple times for different
values of MAJOR_VERSION.

VERSION can be a specific update version, ie. '10.1.6', or the
default, 'latest'.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.AdobeAcrobatProXUpdate</string>
    <key>Input</key>
    <dict>
        <key>MAJOR_VERSION</key>
        <string>10</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/AcrobatPro</string>
        <key>NAME</key>
        <string>AdobeAcrobatProX_Update</string>
        <key>VERSION</key>
        <string>latest</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Adobe Acrobat Pro.app</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string></string>
            <key>display_name</key>
            <string>Adobe Acrobat Pro Update</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>update_for</key>
            <array>
                <string>AdobeAcrobatProX</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.AdobeAcrobatProXUpdate</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
