<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads updates for Adobe Acrobat Pro 9 and imports them into
Munki. It will also set the appropriate 'requires' item for the
previous update in the Munki pkginfo.

Acrobat Pro 9 updates get their own installer type in Munki,
and makepkginfo will handle requiring a logout for these. Acrobat
Pro 9 uses a separate recipe from X/XI as its download is provided
as a zip file, which must be re-packed to a .dmg.

The name(s) in update_for in the pkginfo should be set to the name
of your base Adobe Acrobat Pro 9 item in your Munki repo.

VERSION can be a specific update version, ie. '9.5.2', or the
default, 'latest'.</string>
        <key>Identifier</key>
        <string>com.github.autopkg.munki.AdobeAcrobatPro9Update</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/AcrobatPro</string>
            <key>NAME</key>
            <string>AdobeAcrobatPro9_Update</string>
            <key>VERSION</key>
            <string>latest</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string></string>
                <key>display_name</key>
                <string>Adobe Acrobat Pro Update</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
                <key>update_for</key>
                <array>
                    <string>AdobeAcrobatPro9</string>
                </array>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.download.AdobeAcrobatPro9Update</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>archive_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%dmg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
