<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>This recipe downloads the signed installer package from Amazon Corretto. Because the downloaded file is already a package, this pkg recipe does not add any further actions.

Downloads the latest version of Amazon Corretto JDK. Requires ARCH (x64 [Intel], or aarch64 [Apple Silicon]) and MAJOR_VERSION (8,11,17,18).</string>
        <key>Identifier</key>
        <string>com.github.autopkg.pkg.amazoncorretto</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Amazon Corretto %MAJOR_VERSION%</string>
            <key>MAJOR_VERSION</key>
            <string>8</string>
            <key>ARCH</key>
            <string>x64</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.download.amazoncorretto</string>
        <key>Process</key>
        <array/>
    </dict>
</plist>
