<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Adobe AIR installer and repackages it for unattended, silent installation, then imports into Munki.
Based on jamesz's work here: https://github.com/jamesez/automunki/tree/master/adobe-air</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.AdobeAIR</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeAIR</string>
        <key>URL</key>
        <string>http://airdownload.adobe.com/air/mac/download/latest/AdobeAIR.dmg</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/adobe</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Adobe AIR</string>
            <key>display_name</key>
            <string>Adobe® Integrated Runtime</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>update_for</key>
            <array>
                <string>foo</string>
                <string>bar</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.AdobeAIR</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Import the pkg into Munki!</string>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
