<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest 2.x version of Flip4Mac for OS X 10.5 and 10.6,
and appends the version number to the installer pkg.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.pkg.Flip4Mac-2</string>
    <key>Input</key>
    <dict>
        <key>PKG_NAME</key>
        <string>Flip4Mac WMV.mpkg</string>
        <key>NAME</key>
        <string>Flip4Mac</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.Flip4Mac-2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%pathname%/Flip4Mac WMV.mpkg/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
				</dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%PKG_NAME%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Flip4Mac-%version%.mpkg</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
    </array>
</dict>
</plist>
