<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Spotify and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.Spotify</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Spotify</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/spotify</string>
        <key>MUNKI_CATEGORY</key>
        <string>Multimedia</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Spotify</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>wethinkcode</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>description</key>
            <string>Spotify is a music streaming service offering unlimited streaming of selected music from a range of major and independent record labels.</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash
                # Explicitly setting all binaries to be group and world executable, as the
                # source dmg may have them set as 744.
                /bin/chmod go+x \
                '/Applications/Spotify.app/Contents/Frameworks/Chromium Embedded Framework.framework/Chromium Embedded Framework' \
                '/Applications/Spotify.app/Contents/Frameworks/Spotify Helper.app/Contents/MacOS/Spotify Helper' \
                /Applications/Spotify.app/Contents/MacOS/Spotify \
                /Applications/Spotify.app/Contents/MacOS/SpotifyWebHelper \
                /Applications/Spotify.app/Contents/MacOS/sp_relauncher
            </string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.Spotify</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
