<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Excel 2016 multilingual update pkg,
appends the version to the end of the filename, and imports into
Munki.

If this is an update_for something, you may define this in your
pkginfo Input override below.

LOCALE_ID sets the locale for a descriptive text that will be
extracted from the Microsoft update metadata. See
https://msdn.microsoft.com/en-us/goglobal/bb964664.aspx
for more information about locale IDs.

VERSION supports two values: 'latest', and 'latest-delta', defaulting to
'latest'. If 'latest-delta' is selected, the delta update will be selected
instead of the full update.

If 'latest-delta' is selected, the pkginfo's installs item that's generated
will also include a 'minimum_update_version' set, declaring a minimum app
version to which this delta can be applied. It will also have a 'requires'
item set to this minimum update version, whose name can be set explicitly
with 'munki_required_update_name'. If left blank, NAME will be used.

Note that this recipe doesn't currently support a workflow where _both_
full and delta updates can be imported and clients will automatically select
only the correct update. It only tries to add as much "safety" as possible
when importing a delta update.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.MSExcel2016</string>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MSExcel2016</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>munki_required_update_name</key>
        <string></string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Microsoft Excel</string>
                <string>Microsoft Error Reporting</string>
                <string>Microsoft Auto Update</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.MSExcel2016</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Merge input pkginfo and additional_pkginfo generated by MSOffice2016URLandUpdateInfoProvider</string>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>