<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of WhatsApp and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.scriptingosx.munki.WhatsApp</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Whatsapp</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/whatsapp</string>
		<key>MUNKI_CATEGORY</key>
		<string>Tools</string>
		<key>MUNKI_DEVELOPER</key>
		<string>WhatsApp Inc.</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>wethinkcode</string>
				<string>wethinkcode-testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>description</key>
			<string>WhatsApp Messenger is a cross-platform mobile messaging app which allows you to exchange messages without having to pay for SMS.</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.scriptingosx.download.WhatsApp</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
