<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Praat.

There are two editions that can be downloaded: 32-bit or 64-bit, which
can be overridden by setting ARCH_EDITION to either '32' or '64'.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.download.Praat</string>
	<key>Input</key>
	<dict>
		<key>ARCH_EDITION</key>
		<string>32</string>
		<key>NAME</key>
		<string>Praat</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>arch_edition</key>
				<string>%ARCH_EDITION%</string>
			</dict>
			<key>Processor</key>
			<string>PraatURLProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
