<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and imports the unsigned release of Munki tools version 6
via the official releases listing on GitHub. You can set INCLUDE_PRERELEASES
to any value to have this recipe pull prerelease versions.

NOTE: Use the "com.github.autopkg.munki.munkitools6-signed" recipe to
download the code signed version of the Munki tools via Mac Admins Open Source.

This recipe cannot be overridden to pull a download from an alternate location.

The GitHubReleasesInfoProvider processor used by this recipe also
respects an input variable: 'sort_by_highest_tag_names', which
if set, will ignore the post dates of the releases and instead sort
descending by tag names according to LooseVersion semantics.
</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.munkitools6</string>
    <key>Input</key>
    <dict>
        <key>INCLUDE_PRERELEASES</key>
        <string></string>
        <key>NAME</key>
        <string>munkitools</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>munkitools</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>development</string>
            </array>
            <key>category</key>
            <string>munkitools</string>
            <key>description</key>
            <string>Managed software installation for macOS.</string>
            <key>developer</key>
            <string>The Munki Project</string>
            <key>display_name</key>
            <string>Managed Software Center</string>
            <key>icon_name</key>
            <string>Managed Software Center.png</string>
            <key>minimum_os_version</key>
            <string>10.13</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>^munkitools-6.*?pkg$</string>
                <key>github_repo</key>
                <string>munki/munki</string>
                <key>include_prereleases</key>
                <string>%INCLUDE_PRERELEASES%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
