<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads latest Skype disk image and builds a package.</string>
        <key>Identifier</key>
        <string>com.github.autopkg.pkg.Skype</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Skype</string>
            <key>VERSIONTYPE</key>
            <string>CFBundleVersion</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.1</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.download.Skype</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe has been deprecated. As of May 2025, Microsoft has discontinued Skype. Please remove this recipe from your runs.

For more details, see https://support.microsoft.com/en-us/skype/skype-is-retiring-in-may-2025-what-you-need-to-know-2a7d2501-427f-485e-8be0-2068a9f90472</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%pathname%/Skype.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>%VERSIONTYPE%</string>
                </dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>AppPkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
