<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest examshell and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.examshell</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Examshell</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/examshell</string>
        <key>MUNKI_CATEGORY</key>
        <string>42</string>
        <key>MUNKI_DEVELOPER</key>
        <string>42</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>wethinkcode</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY$</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>description</key>
            <string>ExamShell made by 42 for your lovely exams</string>
            <key>unattended_install</key>
            <false/>
            <key>unattended_uninstall</key>
            <false/>
            <key>uninstall_method</key>
            <string>removepackages</string>
            <key>uninstallable</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>minimum_os_version</key>
    <string>10.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.examshell</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
