<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.jarias.munki.atom</string>
    <key>Description</key>
    <string>Downloads Atom and imports into Munki.</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Atom</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/atom</string>
      <key>MUNKI_CATEGORY</key>
      <string>IDE</string>
      <key>MUNKI_DEVELOPER</key>
      <string>Github</string>
     	<key>pkginfo</key>
      <dict>
          <key>catalogs</key>
          <array>
          <string>wethinkcode</string>
          <string>wethinkcode-testing</string>
          </array>
          <key>description</key>
          <string>Atom is a free and open-source text and source code editor for OS X, Linux, and Windows with support for plug-ins written in Node.js, and embedded Git Control, developed by GitHub. Atom is a desktop application built using web technologies.</string>
          <key>display_name</key>
          <string>%NAME%</string>
          <key>name</key>
          <string>%NAME%</string>
          <key>category</key>
         	<string>%MUNKI_CATEGORY%</string>
          <key>developer</key>
          <string>%MUNKI_DEVELOPER%</string>
      </dict>
    </dict>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>https://atom.io/download/mac</string>
          <key>filename</key>
          <string>%NAME%.zip</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>archive_path</key>
          <string>%pathname%</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          <key>purge_destination</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>DmgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>dmg_root</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          <key>dmg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%dmg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict>
</plist>
