<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest OmniDiskSweeper disk image and installs into /Applications.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.install.OmniDiskSweeper</string>
	<key>Input</key>
	<dict>
		<key>DESTINATION_PATH</key>
		<string>/Applications/</string>
		<key>NAME</key>
		<string>OmniDiskSweeper</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.OmniDiskSweeper</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
				<key>items_to_copy</key>
				<array>
					<dict>
						<key>destination_path</key>
						<string>%DESTINATION_PATH%</string>
						<key>source_item</key>
						<string>OmniDiskSweeper.app</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>InstallFromDMG</string>
		</dict>
	</array>
</dict>
</plist>
