<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest OmniPlan 2 disk image.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.omniplan</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OmniPlan</string>
        <key>APPCAST_URL</key>
        <string>https://update.omnigroup.com/appcast/com.omnigroup.OmniPlan2</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.omnigroupproduct</string>
</dict>
</plist>
