<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest OmniOutliner 5 disk image.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.omnioutliner5</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OmniOutliner5</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.omnigroupproduct</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/OmniOutliner.app</string>
                <key>requirement</key>
                <string>identifier "com.omnigroup.OmniOutliner5" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "34YW5XSRB7"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
