<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest OmniOutliner 4 disk image.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.omnioutliner4</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OmniOutliner4</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.omnigroupproduct</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/OmniOutliner.app</string>
                <key>requirement</key>
                <string>certificate leaf = H"26fe998f5ff3bad1beeac952a233231d4e5ad523" and identifier "com.omnigroup.OmniOutliner4"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>