<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest OmniDiskSweeper disk image.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.download.OmniDiskSweeper</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OmniDiskSweeper</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.omnigroupproduct</string>
</dict>
</plist>
