<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Visual Studio Code. and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.valdore86.munki.visualstudiocode</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Visual Studio Code</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/visualstudiocode</string>
            <key>MUNKI_CATEGORY</key>
            <string>IDE</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Microsoft</string>
            <key>blocking_applications</key>
            <array>
                <string>Visual Studio Code</string>
            </array>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>wethinkcode</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>description</key>
                <string>Code combines the streamlined UI of a modern editor with rich code assistance and navigation, and an integrated debugging experience – without the need for a full IDE.</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>ParentRecipe</key>
        <string>com.github.valdore86.download.visualstudiocode</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Visual Studio Code.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%dmg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                    <key>version_comparison_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
