<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Visual Studio Codem and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.wethinkcode.recipes</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Visual Studio Code</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/visualstudiocode</string>
            <key>MUNKI_CATEGORY</key>
            <string>IDE</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Microsoft</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>wethinkcode</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>description</key>
                <string>Visual Studio Code is a source code editor developed by Microsoft for Windows, Linux and OS X. It is free and open-source, and includes support for debugging, embedded Git control, syntax highlighting, intelligent code completion, snippets, and code refactoring.</string>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%dmg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                    <key>version_comparison_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
